from sanic import Blueprint, json

data_bp = Blueprint("data", url_prefix="/api")

# Статический список известных космодромов
LAUNCH_SITES = [
    {
      "name": "Мыс Канаверал (CCAFS), США",
      "lat": 28.492,
      "lon": -80.577
    },
    {
      "name": "Космический центр Кеннеди (KSC), США",
      "lat": 28.573,
      "lon": -80.649
    },
    {
      "name": "Ванденберг (VBG), США",
      "lat": 34.742,
      "lon": -120.572
    },
    {
      "name": "Уоллопс (MARS), США",
      "lat": 37.834,
      "lon": -75.484
    },
    {
      "name": "Кодьяк (PSCA), США",
      "lat": 57.436,
      "lon": -152.337
    },
    {
      "name": "Starbase (SpaceX), США",
      "lat": 25.997,
      "lon": -97.156
    },
    {
      "name": "Байконур, Казахстан",
      "lat": 45.965,
      "lon": 63.305
    },
    {
      "name": "Плесецк, Россия",
      "lat": 62.956,
      "lon": 40.577
    },
    {
      "name": "Восточный, Россия",
      "lat": 51.884,
      "lon": 128.334
    },
    {
      "name": "Куру, Французская Гвиана",
      "lat": 5.239,
      "lon": -52.768
    },
    {
      "name": "Цзюцюань, Китай",
      "lat": 40.968,
      "lon": 100.291
    },
    {
      "name": "Тайюань, Китай",
      "lat": 38.849,
      "lon": 111.608
    },
    {
      "name": "Сичан, Китай",
      "lat": 28.246,
      "lon": 102.026
    },
    {
      "name": "Вэньчан, Китай",
      "lat": 19.614,
      "lon": 110.951
    },
    {
      "name": "Морская платформа в Желтом море, Китай",
      "lat": 34.900,
      "lon": 121.000
    },
    {
      "name": "Сатиш Дхаван, Индия",
      "lat": 13.733,
      "lon": 80.235
    },
    {
      "name": "Танэгасима, Япония",
      "lat": 30.400,
      "lon": 130.967
    },
    {
      "name": "Наро, Южная Корея",
      "lat": 34.432,
      "lon": 127.535
    },
    {
      "name": "Семнан, Иран",
      "lat": 35.222,
      "lon": 53.921
    },
    {
      "name": "Шахруд, Иран",
      "lat": 36.418,
      "lon": 54.996
    },
    {
      "name": "Пальмахим, Израиль",
      "lat": 31.884,
      "lon": 34.688
    },
    {
      "name": "Махия, Новая Зеландия",
      "lat": -39.261,
      "lon": 177.865
    }
  ]

@data_bp.get("/launch_sites")
async def get_launch_sites(request):
    """Возвращает список известных космодромов."""
    return json(LAUNCH_SITES)